{
    "version": "normal",
    "title": "Dự án: Music Extension",
    "downloadLink": "module-music-extension",
    "introduction": "\"Music Extension\" mở rộng và cải thiện hệ thống âm nhạc cho Minecraft Bedrock. Nó bổ sung một Music box tùy chỉnh với các hiệu ứng hoạt hình thú vị và năm đĩa nhạc mới từ T-en-M. Bạn cũng có thể thêm âm thanh tùy chỉnh của riêng bạn vào gói này với một công cụ đơn giản! Bây giờ bạn có thể thưởng thức những giai điệu tuyệt vời trong khi chơi Minecraft và làm cho cuộc phiêu lưu của bạn thêm phần thú vị!<br><br>Hãy xem addon này có gì để cung cấp nhé!",
    "content": [
        {
            "type": "img",
            "text": "Đây là Music Box! Một khối mới hoàn toàn cho phép bạn phát đĩa nhạc!<br><br> Nhưng chúng ta đã có Juke Box để làm điều đó phải không? Đừng lo, bạn sẽ thấy tại sao Music Box lại tốt hơn (và rẻ để chế tạo nữa...)"
        },
        {
            "type": "img",
            "text": "Hãy bắt đầu với công thức chế tạo của nó! Chỉ cần 5 mảnh ván, 1 đá redstone, một cái que và một miếng vàng ròng, rồi... Music Box!"
        },
        {
            "type": "img",
            "text": "Để sử dụng Music Box, khi cầm đĩa nhạc, nhấp chuột phải vào phía TRÊN của Box! Music Box sẽ hoạt động với mọi loại đĩa nhạc, vì vậy đừng lo lắng!"
        },
        {
            "type": "img",
            "text": "Để lấy lại đĩa, nhấp chuột phải vào bất kỳ bên nào của Music Box và nó sẽ đưa ra đĩa trở lại trạng thái ban đầu!"
        },
        {
            "type": "img",
            "text": "Bạn chỉ có thể phá vỡ khối từ bất kỳ bên nào trừ phía trên! (Bạn không muốn phá vỡ cây kim vàng dễ vỡ, phải không?)"
        },
        {
            "type": "img",
            "text": "Để nghe một bài hát lặp đi lặp lại, đơn giản đặt một khối vàng vào bên mà kim chỉ đang hướng tới! Bạn sẽ thấy chỉ báo vòng vàng xuất hiện! Từ giờ, bài hát của bạn sẽ được phát lại liên tục!"
        },
        {
            "type": "img",
            "text": "Một tính năng thú vị cho kỹ sư redstone: Nếu có bất kỳ khối nào không phải khối không khí ở trên Music Box, Box sẽ tự động reset lại để phát lại! Vì vậy, nếu bạn muốn dừng âm nhạc tự động, chỉ cần đặt một số piston và thiết lập nó!"
        },
        {
            "type": "img",
            "text": "Addon này cũng thêm vào một số bản nhạc thú vị từ T-en-M! Yay! Bạn cần chế tạo các đĩa này bằng 8 than gỗ, tôi lặp lại, là than gỗ... không phải than đá, và ở giữa, đơn giản chỉ cần đặt các vật phẩm đặc biệt cho mỗi đĩa đặc biệt!"
        },
        {
            "type": "img",
            "text": "Người Buôn Bán Lang Thang cũng sẽ cung cấp đĩa đặc biệt chỉ với 5 viên ngọc lam mỗi đĩa<br><br>(Rẻ quá chời rẻ, phải không?)"
        },
        {
            "type": "img",
            "text": "[QUAN TRỌNG]: Bạn cũng có thể thêm âm thanh tùy chỉnh của riêng bạn! Sử dụng công cụ thử nghiệm dưới đây!<br><br>- Công thức sẽ sử dụng Than và thuốc nhuộm! Như bạn có thể thấy trong hình ảnh, mỗi màu thuốc nhuộm được chỉ định số học! Điều này có ý nghĩa gì? Điều đó có nghĩa là nếu bạn tải lên chỉ một tệp âm thanh, âm thanh đó sẽ được gán cho đĩa màu trắng, và như vậy. Nếu bạn tải lên nhiều tệp âm thanh, thứ tự của chúng sẽ xác định đĩa nào sẽ có âm thanh gì!<br><br>- Xin lưu ý rằng ngay cả khi bạn chỉ thêm một tệp âm thanh hoặc không tải lên bất cứ file gì, các đĩa trống vẫn sẽ được bao gồm, nhưng chúng sẽ không phát bất cứ gì!"
        }
    ],
    "customizable": {
        "style": [
            ".custom-file-input {",
            "border-radius: 0.5vw;",
            "text-align: center;",
            "padding: 5px;",
            "display: flex;",
            "align-items: center;",
            "justify-content: center;",
            "background-color: #4229B9;",
            "color: white;",
            "cursor: pointer;",
            "border: none;",
            "font-family: 'MinecraftFive';",
            "width: 25vw;",
            "height: auto;",
            "font-size: 1.5vw;",
            "transition: 0.35s;",
            "}",
            ".custom-file-input:hover {",
            "}",
            ".custom-file-input-wrapper {",
            "margin-left: 5vw;",
            "}",
            "@media (max-aspect-ratio: 3/4) {",
            ".custom-file-input {",
            "font-size: 2vh !important;",
            "width: 45vw;",
            "}"
        ],
        "content": "<div style=\"width: 100vw; display: flex; align-items: center; justify-content: center;\"><label for=\"musicInput\" class=\"custom-file-input\">Upload Custom Music </label><input type=\"file\" id=\"musicInput\" accept=\".ogg\" multiple hidden></div><div class=\"warning\" style=\"padding-top: 10vh;\">WARNING:  Experimental Customization tool only support OGG file format!<br> Also, its load time may take a while! Please be patient!</div>"
    },
    "postwarning": "CẢNH BÁO: Addon này yêu cầu Upcoming Creator Feature và Holiday Creator Feature để hoạt động!"
}