{
    "version": "normal",
    "title": "Dự án: Redstone Engine Expansion",
    "introduction": "Redstone Engine Expansion là một dự án nhằm mở rộng khả năng của khối Redstone Engine từ Add-On Crafty Plane! Bạn không cần phải tải xuống Add-On Crafty Plane để sử dụng pack này. Đây là một Add-On độc lập mà thêm vào các tính năng hoàn toàn mới. Tuy nhiên, hãy thoải mái kiểm tra Add-On Crafty Plane nếu bạn muốn!",
    "content": [
        {
            "type": "img",
            "text": "Đây là cách chế tạo khối Redstone Engine"
        },
        {
            "type": "img",
            "text": "Tính năng đầu tiên là Redstone Launcher. Cấu trúc này yêu cầu 8 khối đá redstone, 1 máy phóng ở giữa và một thùng làm từ thanh sắt. Cuối cùng, khối Redstone Engine được đặt ở phía giữa khối đá redstone với một nút ở trên đỉnh nó"
        },
        {
            "type": "video",
            "text": "Để sử dụng nó, bạn cần một khối Redstone làm nhiên liệu, đứng trên khối Redstone Engine và nhấp vào nút trên khối Redstone Engine. Sau đó chọn mục tiêu của bạn và Sneak để phóng!"
        },
        {
            "type": "video",
            "text": "Đây là một góc quay khác của Redstone Launcher trong lúc hoạt động."
        },
        {
            "type": "img",
            "text": "Tính năng thứ hai là Redstone Air Defense. Cấu trúc này yêu cầu 1 khối Redstone, 1 Redstone Engine với một nút ở mặt bên của nó, và một máy phóng ở phía trên."
        },
        {
            "type": "video",
            "text": "Đơn giản chỉ cần nhấp vào nút để kích hoạt Redstone Air Defense. Nó sẽ tạo ra một vòm bảo vệ bạn khỏi các đạn pháo từ Redstone Launcher. Lưu ý rằng bất kỳ vụ nổ nào cũng sẽ bị loại bỏ nếu ở bên trong vòm."
        },
        {
            "type": "video",
            "text": "Đây là video về cách Redstone Air Defense hoạt động."
        },
        {
            "type": "video",
            "text": "Đặc điểm cuối cùng là Redstone Nuke. Cấu trúc này yêu cầu 9 khối sắt, 8 khối đá redstone và 1 khối Redstone Engine. Bằng cách đặt khối Redstone Engine vào giữa, bạn sẽ ngay lập tức kích hoạt Redstone Nuke."
        }
    ]
}